src/Catalogs/Currencies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Currencies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WritingParameters</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubordinateRateFrom</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubordinateExchangeRateFactor</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DownloadRatesPeriodically</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Currencies/Ext/ObjectModule.bsl
Procedure FillCheckProcessing(Cancellation, CheckedAttributes)
	
	If DownloadRatesPeriodically And ValueIsFilled(SubordinateRateFrom) Then
		CommonUseClientServer.MessageToUser(
		              NStr("en = 'Currency cannot be dependant and concurrently being downloaded from the RBK web site'"));
		Return;
	EndIf;
	
EndProcedure

Procedure OnWrite(Cancellation)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If ValueIsFilled(SubordinateRateFrom.SubordinateRateFrom) Then
		CommonUseClientServer.MessageToUser(NStr("en = 'Error during record: main currency cannot be dependant'"),,,,Cancellation);
	EndIf;
	
	If WorkWithExchangeRates.GetDependentCurrenciesList(Ref).Count() > 0 
	   And ValueIsFilled(SubordinateRateFrom) Then
		CommonUseClientServer.MessageToUser(NStr("en = 'Record error: the currency cannot be subordinated, as it is main for other currencies'"),,,,Cancellation);
	EndIf;
	
	If Cancellation Then
		Return;
	EndIf;
	
	WorkWithExchangeRates.CheckThatCourseIsCorrectOn01_01_1980(Ref);
	
	If ValueIsFilled(SubordinateRateFrom) Then
		WorkWithExchangeRates.WriteInfoForSubordinateRegister(SubordinateRateFrom, Ref);
	EndIf;
	
EndProcedure
